{
  "content": [
    {
      "id": "1",
      "title": "Electronic Music Events - FED",
      "text": "Front-end React.js project that allows users to search for an event by location or name, as well as posting, editing and/or deleting events.",
      "tools": "React.js, ChakraUI, JSON",
      "link": "https://github.com/XML3/starter-final-project-react"
    },
    {
      "id": "2",
      "title": "Electronic Music Events - BED",
      "text": "Back-end Node.js project. It manages the database to post, edit and delete events.",
      "tools": "Node.js, Express.js, Prisma - MySQL, Planet Scale DB, Sentry...",
      "link": "https://github.com/XML3/express-events-starter/tree/main/starter"
    },
    {
      "id": "3",
      "title": "Properties",
      "text": "Back-end Express API with the implementation of Routers, Middleware, Authentication, Error Handling, and Debugging.  Using Databases / Prisma to connect the database to a back-end app, integrate Prisma in the application, create data models and schemas, querying and modifying data, and dealing with schema changes and migrations. The app allows users to create, view, update and delete: * Users * Hosts * Properties - also will have their average rate updated through review’s scores. * Amenities  * Bookings * Reviews ",
      "tools": "Node.js, Express.js, Prisma - MySQL, Planet Scale DB, Sentry, ... more",
      "link": "https://github.com/XML3/BED-Final-Project"
    },
    {
      "id": "4",
      "title": "Recipes Search",
      "text": "Front-end React.js project that allows the user to search for recepies ... more",
      "tools": "React.js, ChakraUI, JSON",
      "link": "https://github.com/XML3/react-basics-project-starter"
    }
  ],
  "about": [
    {
      "id": "1",
      "title": "About Me",
      "AboutMe": "Hi, I am a Full-stack Web Developer based out of Amsterdam, Netherlands with a strong focus on efficiency and an innate attention to detail, I posses a natural aptitude for understanding the intricacies of design and code structure.  Committed to continual growth to make a lasting impact on user experience.  Hi, I am a Full-stack Web Developer based out of Amsterdam, Netherlands with a strong focus on efficiency and an innate attention to detail, I posses a natural aptitude for understanding the intricacies of design and code structure.  Committed to continual growth to make a lasting impact on user experience."
    }
  ]
}
