{
  "content": [
    {
      "id": "1",
      "title": "Electronic Music Events - Front-End",
      "text": "Front-end React.js project, designed to simulate the enhancement of your event experience. Seamlessly search for events by location or name, dive into informative articles, and effortlessly connect via our contact form.  The app allows event creators with intuitive tools to effortlessly manage their events. From creating, editing, to deleting events, we've streamlined the process for smooth event management experience. The project is meant to provide the versatility and convenience for event exploration and organization.",
      "tools": "React.js, ChakraUI, JSON",
      "link": "https://github.com/XML3/starter-final-project-react"
    },
    {
      "id": "2",
      "title": "Electronic Music Events - Express API",
      "text": "This Back-end ExpressAPI project is the backbone of the event management system. This project effectively manages the database, enabling seamless posting, editing, and deletion of events.  Additionally, this back-end handles the contact form functionality using nodemailer, facilitating smooth communication between users and event organizers. Furthermore, it seamlessly manages image uploads by users, ensuring they are efficiently hosted on an image hosting site for their respective events.  It coherently integrates with the front-end solution to deliver a comprehensive event management experience.",
      "tools": "Node.js, Express.js, Prisma - MySQL, Planet Scale DB, Sentry",
      "link": "https://github.com/XML3/express-events-starter/tree/main/starter"
    },
    {
      "id": "3",
      "title": "Properties - Express API",
      "text": "Back-end Express API project, aimed at replicating the functionality of a property booking system online. This project enables users and hosts to interact with the platform, allowing them to create, view, update, and delete their personal bookings or properties effortlessly.   Moreover, the API facilitates the rating of properties and the creation of reviews, allowing users to share their experiences and insights. Notably, the system dynamically calculates the average rating for each property, ensuring up-to-date and accurate feedback for users. ",
      "tools": "Node.js, Express.js, Prisma - MySQL, Planet Scale DB, Sentry",
      "link": "https://github.com/XML3/BED-Final-Project"
    },
    {
      "id": "4",
      "title": "Recipes - Front-End",
      "text": "A simple Front-end React.js project designed to elevate your culinary journey. Explore an array of recipes by effortlessly searching with keywords, along with specific dietary preferences like label, diet labels, cautions, and health labels. Enhancing the user experience, this project incorporates color-coded sections on recipe cards to denote whether the recipe is Vegetarian or Vegan, as well as color labels highlighting cautions and dietary preferences.  A delightful culinary adventure created with an intuitive React.js project, meticulously crafted to cater to dietary needs and preferences. Explore, cook, and enjoy!",
      "tools": "React.js, ChakraUI, JSON",
      "link": "https://github.com/XML3/react-basics-project-starter"
    },
    {
      "id": "5",
      "title": "Simple Drum Machine",
      "text": "An interactive drum-machine built using React.js. Featuring two sets of dynamic sound banks, switchable with the click of a button, it offers a versatile musical experience. Whether tapping the drum pads with your mouse or keyboard, this fun project allows you to immerse yourself in the beat and unleash your creativity.",
      "tools": "React.js, CSS",
      "link": "https://codepen.io/XML3/pen/vYwOgao?editors=1111"
    }
  ],
  "about": [
    {
      "id": "1",
      "title": "About Me",
      "AboutMe": "Hi, I am a Full-stack Web Developer based out of Amsterdam, Netherlands with a strong focus on efficiency and an innate attention to detail, I posses a natural aptitude for understanding the intricacies of design and code structure.  Committed to continual growth to make a lasting impact on user experience.  Hi, I am a Full-stack Web Developer based out of Amsterdam, Netherlands with a strong focus on efficiency and an innate attention to detail, I posses a natural aptitude for understanding the intricacies of design and code structure.  Committed to continual growth to make a lasting impact on user experience."
    }
  ],
  "port": [
    {
      "id": "1",
      "title": "GitHub Portfolio",
      "text": "A collection of Front-end and Back-end repositories"
    },
    {
      "id": "2",
      "title": "CodePen Projects",
      "text": "Interactive creative code projects"
    }
  ]
}
